keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCbs_regdef.h
/**
 * \file IfxCbs_regdef.h
 * \brief
 * \copyright Copyright (c) 2012 Infineon Technologies AG. All rights reserved.
 *
 *
 * $Revision: 1586 $
 * $Date: 2013-09-03 14:43:49 +0200 (Di, 03 Sep 2013) $
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Cbs Cbs
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Cbs_Bitfields Bitfields
 * \ingroup IfxLld_Cbs
 * 
 * \defgroup IfxLld_Cbs_union Union
 * \ingroup IfxLld_Cbs
 * 
 * \defgroup IfxLld_Cbs_struct Struct
 * \ingroup IfxLld_Cbs
 * 
 */
#ifndef IFXCBS_REGDEF_H
#define IFXCBS_REGDEF_H
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Cbs_Bitfields
 * \{  */

/** \\brief  Communication Mode Data Register */
typedef struct _Ifx_CBS_COMDATA_Bits
{
    unsigned int DATA:32;                   /**< \brief [31:0] Read/Write Data (rw) */
} Ifx_CBS_COMDATA_Bits;

/** \\brief  Internally Controlled Trace Source Register */
typedef struct _Ifx_CBS_ICTSA_Bits
{
    unsigned int ADDR:32;                   /**< \brief [31:0] Source Address (rw) */
} Ifx_CBS_ICTSA_Bits;

/** \\brief  Internally Controlled Trace Destination Register */
typedef struct _Ifx_CBS_ICTTA_Bits
{
    unsigned int ADDR:32;                   /**< \brief [31:0] Destination Address (rw) */
} Ifx_CBS_ICTTA_Bits;

/** \\brief  Internal Mode Status and Control Register */
typedef struct _Ifx_CBS_INTMOD_Bits
{
    unsigned int SET_CRS:1;                 /**< \brief [0:0] Set Read Sync Flag (w) */
    unsigned int SET_CWS:1;                 /**< \brief [1:1] Set Write Sync Flag (w) */
    unsigned int SET_CS:1;                  /**< \brief [2:2] Set Communication Synchronization Flag (w) */
    unsigned int CLR_CS:1;                  /**< \brief [3:3] Clear Communication Synchronization Flag (w) */
    unsigned int CHANNEL_P:1;               /**< \brief [4:4] CHANNEL Write Protection (w) */
    unsigned int CHANNEL:3;                 /**< \brief [7:5] Channel Indication (rw) */
    unsigned int reserved_8:8;              /**< \brief \internal Reserved */
    unsigned int SET_INT_MOD:1;             /**< \brief [16:16] Enter Internal Mode (w) */
    unsigned int reserved_17:1;             /**< \brief \internal Reserved */
    unsigned int SET_INT_TRC:1;             /**< \brief [18:18] Enable Internally Controlled Triggered Transfer (w) */
    unsigned int CLR_INT_TRC:1;             /**< \brief [19:19] Disable Internally Controlled Triggered Transfer (w) */
    unsigned int TRC_MOD_P:1;               /**< \brief [20:20] TRC_MOD Write Protection (w) */
    unsigned int TRC_MOD:2;                 /**< \brief [22:21] Data Size Definition for Triggered Transfer (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int INT_MOD:1;                 /**< \brief [24:24] Internal Mode Enabled Flag (rh) */
    unsigned int INT_TRC:1;                 /**< \brief [25:25] Internally Controlled Triggered Transfer Enable (rh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_CBS_INTMOD_Bits;

/** \\brief  IOClient Status and Control Register */
typedef struct _Ifx_CBS_IOSR_Bits
{
    unsigned int reserved_0:4;              /**< \brief \internal Reserved */
    unsigned int CRSYNC:1;                  /**< \brief [4:4] Communication Mode Read Sync Flag (rh) */
    unsigned int CWSYNC:1;                  /**< \brief [5:5] Communication Mode Write Sync Flag (rh) */
    unsigned int CW_ACK:1;                  /**< \brief [6:6] Communication Mode Write Acknowledge (w) */
    unsigned int COM_SYNC:1;                /**< \brief [7:7] Communication Mode Synchronization Flag (rh) */
    unsigned int HOSTED:1;                  /**< \brief [8:8] Tool Interface in Use (rh) */
    unsigned int reserved_9:3;              /**< \brief \internal Reserved */
    unsigned int CHANNEL:3;                 /**< \brief [14:12] Channel Indication (rh) */
    unsigned int reserved_15:17;            /**< \brief \internal Reserved */
} Ifx_CBS_IOSR_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_CBS_JDPID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MOD_TYPE:8;                /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_CBS_JDPID_Bits;

/** \\brief  JTAG Device Identification Register */
typedef struct _Ifx_CBS_JTAGID_Bits
{
    unsigned int JTAG_ID:32;                /**< \brief [31:0] JTAG Device ID (rw) */
} Ifx_CBS_JTAGID_Bits;

/** \\brief  OSCU Control Register */
typedef struct _Ifx_CBS_OCNTRL_Bits
{
    unsigned int OC0_P:1;                   /**< \brief [0:0] OCx Write Protection (w) */
    unsigned int OC0:1;                     /**< \brief [1:1] Set/Clear OCDS Control Bits Bus Domain (w) */
    unsigned int OC1_P:1;                   /**< \brief [2:2] OCx Write Protection (w) */
    unsigned int OC1:1;                     /**< \brief [3:3] Set/Clear OCDS Control Bits Bus Domain (w) */
    unsigned int OC2_P:1;                   /**< \brief [4:4] OCx Write Protection (w) */
    unsigned int OC2:1;                     /**< \brief [5:5] Set/Clear OCDS Control Bits Bus Domain (w) */
    unsigned int OC3_P:1;                   /**< \brief [6:6] OCx Write Protection (w) */
    unsigned int OC3:1;                     /**< \brief [7:7] Set/Clear OCDS Control Bits Bus Domain (w) */
    unsigned int OC4_P:1;                   /**< \brief [8:8] OCx Write Protection (w) */
    unsigned int OC4:1;                     /**< \brief [9:9] Set/Clear OCDS Control Bits Bus Domain (w) */
    unsigned int OC5_P:1;                   /**< \brief [10:10] OCx Write Protection (w) */
    unsigned int OC5:1;                     /**< \brief [11:11] Set/Clear OCDS Control Bits Bus Domain (w) */
    unsigned int WDTSUS_P:1;                /**< \brief [12:12] WDTSUS Write Protection (w) */
    unsigned int WDTSUS:1;                  /**< \brief [13:13] Set/Clear Watchdog Timer Suspension Control (w) */
    unsigned int STABLE_P:1;                /**< \brief [14:14] STABLE Write Protection (w) */
    unsigned int STABLE:1;                  /**< \brief [15:15] Initialize Application Reset Indication (w) */
    unsigned int OJC0_P:1;                  /**< \brief [16:16] OJCx Write Protection (w) */
    unsigned int OJC0:1;                    /**< \brief [17:17] Set/Clear OCDS Control Bits IOClient Domain (w) */
    unsigned int OJC1_P:1;                  /**< \brief [18:18] OJCx Write Protection (w) */
    unsigned int OJC1:1;                    /**< \brief [19:19] Set/Clear OCDS Control Bits IOClient Domain (w) */
    unsigned int OJC2_P:1;                  /**< \brief [20:20] OJCx Write Protection (w) */
    unsigned int OJC2:1;                    /**< \brief [21:21] Set/Clear OCDS Control Bits IOClient Domain (w) */
    unsigned int OJC3_P:1;                  /**< \brief [22:22] OJCx Write Protection (w) */
    unsigned int OJC3:1;                    /**< \brief [23:23] Set/Clear OCDS Control Bits IOClient Domain (w) */
    unsigned int OJC4_P:1;                  /**< \brief [24:24] OJCx Write Protection (w) */
    unsigned int OJC4:1;                    /**< \brief [25:25] Set/Clear OCDS Control Bits IOClient Domain (w) */
    unsigned int OJC5_P:1;                  /**< \brief [26:26] OJCx Write Protection (w) */
    unsigned int OJC5:1;                    /**< \brief [27:27] Set/Clear OCDS Control Bits IOClient Domain (w) */
    unsigned int OJC6_P:1;                  /**< \brief [28:28] OJCx Write Protection (w) */
    unsigned int OJC6:1;                    /**< \brief [29:29] Set/Clear OCDS Control Bits IOClient Domain (w) */
    unsigned int OJC7_P:1;                  /**< \brief [30:30] OJCx Write Protection (w) */
    unsigned int OJC7:1;                    /**< \brief [31:31] Set/Clear OCDS Control Bits IOClient Domain (w) */
} Ifx_CBS_OCNTRL_Bits;

/** \\brief  OCDS Enable Control Register */
typedef struct _Ifx_CBS_OEC_Bits
{
    unsigned int PAT:8;                     /**< \brief [7:0] OCDS Enabling Pattern (w) */
    unsigned int DS:1;                      /**< \brief [8:8] Disable OCDS (w) */
    unsigned int OCO:1;                     /**< \brief [9:9] OCDS Clock Off (w) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int IF_LCK_P:1;                /**< \brief [16:16] IF_LCK Write Protection (w) */
    unsigned int IF_LCK:1;                  /**< \brief [17:17] Set/Clear Interface Locked Indication (w) */
    unsigned int AUT_OK_P:1;                /**< \brief [18:18] AUT_OK Write Protection (w) */
    unsigned int AUT_OK:1;                  /**< \brief [19:19] Set/Clear the Authorization OK Indication (w) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_CBS_OEC_Bits;

/** \\brief  OCDS Interface Mode Register */
typedef struct _Ifx_CBS_OIFM_Bits
{
    unsigned int DAPMODE:3;                 /**< \brief [2:0] DAP Interface Mode (rw) */
    unsigned int DAPRST:1;                  /**< \brief [3:3] DAP Protocol Clear (rwh) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int F_JTAG:1;                  /**< \brief [8:8] Forced JTAG Mode (rw) */
    unsigned int N_JTAG:1;                  /**< \brief [9:9] No Switch to JTAG (rw) */
    unsigned int reserved_10:2;             /**< \brief \internal Reserved */
    unsigned int PADCTL:4;                  /**< \brief [15:12] Pad Control for Debug Interface Pins (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CBS_OIFM_Bits;

/** \\brief  OSCU Status Register */
typedef struct _Ifx_CBS_OSTATE_Bits
{
    unsigned int OEN:1;                     /**< \brief [0:0] OCDS Enabled Flag (rh) */
    unsigned int OC0:1;                     /**< \brief [1:1] OCDS Control Bits System Bus Domain (rh) */
    unsigned int OC1:1;                     /**< \brief [2:2] OCDS Control Bits System Bus Domain (rh) */
    unsigned int OC2:1;                     /**< \brief [3:3] OCDS Control Bits System Bus Domain (rh) */
    unsigned int ENIDIS:1;                  /**< \brief [4:4] OCDS ENDINIT Protection Override (rh) */
    unsigned int EECTRC:1;                  /**< \brief [5:5] On Chip Trace Enable (rh) */
    unsigned int EECDIS:1;                  /**< \brief [6:6] Emulation Logic Disable (rh) */
    unsigned int WDTSUS:1;                  /**< \brief [7:7] Control of Watchdog Timer Suspension (rh) */
    unsigned int HARR:1;                    /**< \brief [8:8] Halt after Reset Request (rh) */
    unsigned int OJC1:1;                    /**< \brief [9:9] OCDS Control Bits IOClient Domain (rh) */
    unsigned int OJC2:1;                    /**< \brief [10:10] OCDS Control Bits IOClient Domain (rh) */
    unsigned int OJC3:1;                    /**< \brief [11:11] OCDS Control Bits IOClient Domain (rh) */
    unsigned int RSTCL0:1;                  /**< \brief [12:12] OCDS System Reset Request (rh) */
    unsigned int RSTCL1:1;                  /**< \brief [13:13] OCDS Debug Reset Request (rh) */
    unsigned int OJC6:1;                    /**< \brief [14:14] OCDS Control Bits IOClient Domain (rh) */
    unsigned int RSTCL3:1;                  /**< \brief [15:15] OCDS Application Reset Request (rh) */
    unsigned int IF_LCK:1;                  /**< \brief [16:16] Interface Locked Indication (rh) */
    unsigned int AUT_OK:1;                  /**< \brief [17:17] Authorization OK Indication (rh) */
    unsigned int STABLE:1;                  /**< \brief [18:18] Application Reset Indication (rh) */
    unsigned int OCO:1;                     /**< \brief [19:19] OCDS debug resource Clock On Indication (rh) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_CBS_OSTATE_Bits;

/** \\brief  TG Capture for Cores - BRKOUT */
typedef struct _Ifx_CBS_TCCB_Bits
{
    unsigned int C0:1;                      /**< \brief [0:0] Capture of BRKOUT Signal of CPUx (rh) */
    unsigned int C1:1;                      /**< \brief [1:1] Capture of BRKOUT Signal of CPUx (rh) */
    unsigned int C2:1;                      /**< \brief [2:2] Capture of BRKOUT Signal of CPUx (rh) */
    unsigned int reserved_3:28;             /**< \brief \internal Reserved */
    unsigned int HSM:1;                     /**< \brief [31:31] Capture of BRKOUT Signal of HSM (rh) */
} Ifx_CBS_TCCB_Bits;

