keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCbs_regdef.h
/** \\brief  TG Line Counter Value */
typedef struct _Ifx_CBS_TLCV_Bits
{
    unsigned int CV:31;                     /**< \brief [30:0] Count Value (rh) */
    unsigned int SO:1;                      /**< \brief [31:31] Sticky Overflow Bit (rh) */
} Ifx_CBS_TLCV_Bits;

/** \\brief  TG Line State */
typedef struct _Ifx_CBS_TLS_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int TL1:1;                     /**< \brief [1:1] Current State of Trigger Line x (rh) */
    unsigned int TL2:1;                     /**< \brief [2:2] Current State of Trigger Line x (rh) */
    unsigned int TL3:1;                     /**< \brief [3:3] Current State of Trigger Line x (rh) */
    unsigned int TL4:1;                     /**< \brief [4:4] Current State of Trigger Line x (rh) */
    unsigned int TL5:1;                     /**< \brief [5:5] Current State of Trigger Line x (rh) */
    unsigned int TL6:1;                     /**< \brief [6:6] Current State of Trigger Line x (rh) */
    unsigned int TL7:1;                     /**< \brief [7:7] Current State of Trigger Line x (rh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_CBS_TLS_Bits;

/** \\brief  TG Line Timer */
typedef struct _Ifx_CBS_TLT_Bits
{
    unsigned int TGL:4;                     /**< \brief [3:0] Timer to Trigger Line Routing (rw) */
    unsigned int VTZ:1;                     /**< \brief [4:4] TG Line Value when Timer Value is Zero (rw) */
    unsigned int reserved_5:11;             /**< \brief \internal Reserved */
    unsigned int TIM:16;                    /**< \brief [31:16] Timer Value (rwh) */
} Ifx_CBS_TLT_Bits;

/** \\brief  TG Lines for Trigger to Host */
typedef struct _Ifx_CBS_TLTTH_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int TL1:2;                     /**< \brief [3:2] TG Line Enabling for Trigger to Host (TRIG) (rw) */
    unsigned int TL2:2;                     /**< \brief [5:4] TG Line Enabling for Trigger to Host (TRIG) (rw) */
    unsigned int TL3:2;                     /**< \brief [7:6] TG Line Enabling for Trigger to Host (TRIG) (rw) */
    unsigned int TL4:2;                     /**< \brief [9:8] TG Line Enabling for Trigger to Host (TRIG) (rw) */
    unsigned int TL5:2;                     /**< \brief [11:10] TG Line Enabling for Trigger to Host (TRIG) (rw) */
    unsigned int TL6:2;                     /**< \brief [13:12] TG Line Enabling for Trigger to Host (TRIG) (rw) */
    unsigned int TL7:2;                     /**< \brief [15:14] TG Line Enabling for Trigger to Host (TRIG) (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CBS_TLTTH_Bits;

/** \\brief  TG Output Pins Pulse Stretcher */
typedef struct _Ifx_CBS_TOPPS_Bits
{
    unsigned int PIN0:2;                    /**< \brief [1:0] Pulse Stretch Control for Trigger Pin x (rw) */
    unsigned int PIN1:2;                    /**< \brief [3:2] Pulse Stretch Control for Trigger Pin x (rw) */
    unsigned int PIN2:2;                    /**< \brief [5:4] Pulse Stretch Control for Trigger Pin x (rw) */
    unsigned int PIN3:2;                    /**< \brief [7:6] Pulse Stretch Control for Trigger Pin x (rw) */
    unsigned int PIN4:2;                    /**< \brief [9:8] Pulse Stretch Control for Trigger Pin x (rw) */
    unsigned int PIN5:2;                    /**< \brief [11:10] Pulse Stretch Control for Trigger Pin x (rw) */
    unsigned int PIN6:2;                    /**< \brief [13:12] Pulse Stretch Control for Trigger Pin x (rw) */
    unsigned int PIN7:2;                    /**< \brief [15:14] Pulse Stretch Control for Trigger Pin x (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CBS_TOPPS_Bits;

/** \\brief  TG Output Pins Routing */
typedef struct _Ifx_CBS_TOPR_Bits
{
    unsigned int PIN0:4;                    /**< \brief [3:0] Trigger Line to Trigger Pin x Routing (rw) */
    unsigned int PIN1:4;                    /**< \brief [7:4] Trigger Line to Trigger Pin x Routing (rw) */
    unsigned int PIN2:4;                    /**< \brief [11:8] Trigger Line to Trigger Pin x Routing (rw) */
    unsigned int PIN3:4;                    /**< \brief [15:12] Trigger Line to Trigger Pin x Routing (rw) */
    unsigned int PIN4:4;                    /**< \brief [19:16] Trigger Line to Trigger Pin x Routing (rw) */
    unsigned int PIN5:4;                    /**< \brief [23:20] Trigger Line to Trigger Pin x Routing (rw) */
    unsigned int PIN6:4;                    /**< \brief [27:24] Trigger Line to Trigger Pin x Routing (rw) */
    unsigned int PIN7:4;                    /**< \brief [31:28] Trigger Line to Trigger Pin x Routing (rw) */
} Ifx_CBS_TOPR_Bits;

/** \\brief  TG Routing for CPU */
typedef struct _Ifx_CBS_TRC_Bits
{
    unsigned int HALT:4;                    /**< \brief [3:0] HALT to Trigger Line Routing (rw) */
    unsigned int BRKOUT:4;                  /**< \brief [7:4] BRKOUT to Trigger Line Routing (rw) */
    unsigned int BT1:1;                     /**< \brief [8:8] BRKOUT to Trigger Line 1 Routing (rw) */
    unsigned int reserved_9:11;             /**< \brief \internal Reserved */
    unsigned int BRKIN:4;                   /**< \brief [23:20] Trigger Line to BRKIN Routing (rw) */
    unsigned int SUSIN:4;                   /**< \brief [27:24] Trigger Line to SUSIN Routing (rw) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_CBS_TRC_Bits;

/** \\brief  TG Routing Events of CPU */
typedef struct _Ifx_CBS_TREC_Bits
{
    unsigned int TR0EV:4;                   /**< \brief [3:0] TRxEVT to Trigger Line Routing (rw) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int TR2EV:4;                   /**< \brief [11:8] TRxEVT to Trigger Line Routing (rw) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int TR4EV:4;                   /**< \brief [19:16] TRxEVT to Trigger Line Routing (rw) */
    unsigned int reserved_20:4;             /**< \brief \internal Reserved */
    unsigned int TR6EV:4;                   /**< \brief [27:24] TRxEVT to Trigger Line Routing (rw) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_CBS_TREC_Bits;

/** \\brief  TG Routing for HSM Control */
typedef struct _Ifx_CBS_TRHSM_Bits
{
    unsigned int HALT:4;                    /**< \brief [3:0] HALT to Trigger Line Routing (rw) */
    unsigned int BRKOUT:4;                  /**< \brief [7:4] BRKOUT to Trigger Line Routing (rw) */
    unsigned int BT1:1;                     /**< \brief [8:8] BRKOUT to Trigger Line 1 Routing (rw) */
    unsigned int reserved_9:11;             /**< \brief \internal Reserved */
    unsigned int BRKIN:4;                   /**< \brief [23:20] Trigger Line to BRKIN Routing (rw) */
    unsigned int SUSIN:4;                   /**< \brief [27:24] Trigger Line to SUSIN Routing (rw) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_CBS_TRHSM_Bits;

/** \\brief  Trigger to Host Register */
typedef struct _Ifx_CBS_TRIG_Bits
{
    unsigned int TRGx_0:1;                  /**< \brief [0:0] Service Request Bits (rh) */
    unsigned int TRGx_1:1;                  /**< \brief [1:1] Service Request Bits (rh) */
    unsigned int TRGx_2:1;                  /**< \brief [2:2] Service Request Bits (rh) */
    unsigned int TRGx_3:1;                  /**< \brief [3:3] Service Request Bits (rh) */
    unsigned int TRGx_4:1;                  /**< \brief [4:4] Service Request Bits (rh) */
    unsigned int TRGx_5:1;                  /**< \brief [5:5] Service Request Bits (rh) */
    unsigned int TRGx_6:1;                  /**< \brief [6:6] Service Request Bits (rh) */
    unsigned int TRGx_7:1;                  /**< \brief [7:7] Service Request Bits (rh) */
    unsigned int TRGx_8:1;                  /**< \brief [8:8] Service Request Bits (rh) */
    unsigned int TRGx_9:1;                  /**< \brief [9:9] Service Request Bits (rh) */
    unsigned int TRGx_10:1;                 /**< \brief [10:10] Service Request Bits (rh) */
    unsigned int TRGx_11:1;                 /**< \brief [11:11] Service Request Bits (rh) */
    unsigned int TRGx_12:1;                 /**< \brief [12:12] Service Request Bits (rh) */
    unsigned int TRGx_13:1;                 /**< \brief [13:13] Service Request Bits (rh) */
    unsigned int TRGx_14:1;                 /**< \brief [14:14] Service Request Bits (rh) */
    unsigned int TRGx_15:1;                 /**< \brief [15:15] Service Request Bits (rh) */
    unsigned int TRGx_16:1;                 /**< \brief [16:16] Service Request Bits (rh) */
    unsigned int TRGx_17:1;                 /**< \brief [17:17] Service Request Bits (rh) */
    unsigned int TRGx_18:1;                 /**< \brief [18:18] Service Request Bits (rh) */
    unsigned int TRGx_19:1;                 /**< \brief [19:19] Service Request Bits (rh) */
    unsigned int TRGx_20:1;                 /**< \brief [20:20] Service Request Bits (rh) */
    unsigned int TRGx_21:1;                 /**< \brief [21:21] Service Request Bits (rh) */
    unsigned int TRGx_22:1;                 /**< \brief [22:22] Service Request Bits (rh) */
    unsigned int TRGx_23:1;                 /**< \brief [23:23] Service Request Bits (rh) */
    unsigned int x:8;                       /**< \brief [31:24] TRIG register number (rh) */
} Ifx_CBS_TRIG_Bits;

/** \\brief  Clear Trigger to Host Register */
typedef struct _Ifx_CBS_TRIGC_Bits
{
    unsigned int TRGx_0:1;                  /**< \brief [0:0] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_1:1;                  /**< \brief [1:1] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_2:1;                  /**< \brief [2:2] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_3:1;                  /**< \brief [3:3] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_4:1;                  /**< \brief [4:4] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_5:1;                  /**< \brief [5:5] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_6:1;                  /**< \brief [6:6] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_7:1;                  /**< \brief [7:7] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_8:1;                  /**< \brief [8:8] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_9:1;                  /**< \brief [9:9] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_10:1;                 /**< \brief [10:10] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_11:1;                 /**< \brief [11:11] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_12:1;                 /**< \brief [12:12] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_13:1;                 /**< \brief [13:13] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_14:1;                 /**< \brief [14:14] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_15:1;                 /**< \brief [15:15] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_16:1;                 /**< \brief [16:16] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_17:1;                 /**< \brief [17:17] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_18:1;                 /**< \brief [18:18] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_19:1;                 /**< \brief [19:19] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_20:1;                 /**< \brief [20:20] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_21:1;                 /**< \brief [21:21] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_22:1;                 /**< \brief [22:22] Request Bits of most important register TRIGx (rh) */
    unsigned int TRGx_23:1;                 /**< \brief [23:23] Request Bits of most important register TRIGx (rh) */
    unsigned int x:8;                       /**< \brief [31:24] Index of most important register TRIGx (rh) */
} Ifx_CBS_TRIGC_Bits;

