keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCbs_regdef.h
/** \\brief  TG Capture for Cores - HALT */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TCCH_Bits B;
} Ifx_CBS_TCCH;

/** \\brief  TG Capture for TG Input Pins */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TCIP_Bits B;
} Ifx_CBS_TCIP;

/** \\brief  TG Capture for MCDS */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TCM_Bits B;
} Ifx_CBS_TCM;

/** \\brief  TG Capture for OTGB0/1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TCTGB_Bits B;
} Ifx_CBS_TCTGB;

/** \\brief  TG Capture for TG Lines */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TCTL_Bits B;
} Ifx_CBS_TCTL;

/** \\brief  TG Input Pins Routing */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TIPR_Bits B;
} Ifx_CBS_TIPR;

/** \\brief  TG Line 1 Suspend Targets */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TL1ST_Bits B;
} Ifx_CBS_TL1ST;

/** \\brief  TG Line Control */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TLC_Bits B;
} Ifx_CBS_TLC;

/** \\brief  TG Line Counter Control */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TLCC_Bits B;
} Ifx_CBS_TLCC;

/** \\brief  TG Line Capture and Hold Enable */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TLCHE_Bits B;
} Ifx_CBS_TLCHE;

/** \\brief  TG Line Capture and Hold Clear */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TLCHS_Bits B;
} Ifx_CBS_TLCHS;

/** \\brief  TG Line Counter Value */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TLCV_Bits B;
} Ifx_CBS_TLCV;

/** \\brief  TG Line State */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TLS_Bits B;
} Ifx_CBS_TLS;

/** \\brief  TG Line Timer */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TLT_Bits B;
} Ifx_CBS_TLT;

/** \\brief  TG Lines for Trigger to Host */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TLTTH_Bits B;
} Ifx_CBS_TLTTH;

/** \\brief  TG Output Pins Pulse Stretcher */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TOPPS_Bits B;
} Ifx_CBS_TOPPS;

/** \\brief  TG Output Pins Routing */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TOPR_Bits B;
} Ifx_CBS_TOPR;

/** \\brief  TG Routing for CPU */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TRC_Bits B;
} Ifx_CBS_TRC;

/** \\brief  TG Routing Events of CPU */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TREC_Bits B;
} Ifx_CBS_TREC;

/** \\brief  TG Routing for HSM Control */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TRHSM_Bits B;
} Ifx_CBS_TRHSM;

/** \\brief  Trigger to Host Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TRIG_Bits B;
} Ifx_CBS_TRIG;

/** \\brief  Clear Trigger to Host Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TRIGC_Bits B;
} Ifx_CBS_TRIGC;

/** \\brief  Set Trigger to Host Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TRIGS_Bits B;
} Ifx_CBS_TRIGS;

/** \\brief  TG Routing for MCDS Control */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TRMC_Bits B;
} Ifx_CBS_TRMC;

/** \\brief  TG Routing for MCDS Triggers */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CBS_TRMT_Bits B;
} Ifx_CBS_TRMT;

